[
    {
      "author": "Robert C. Martin",
      "title": "Clean Code: A Handbook of Agile Software Craftsmanship",
      "description": "This essential book teaches software developers how to write clean, maintainable code. With practical examples, it covers principles like meaningful naming, proper function design, effective comments, error handling, and unit testing. The book emphasizes how code quality directly impacts team productivity and software maintainability, making it invaluable for professional developers working on complex systems.",
      "price": 39.99,
      "publisher": "Tech Publications",
      "pages": 464,
      "topics": ["Software Development", "Code Quality", "Best Practices"]
    },
    {
      "author": "Andrew Hunt, David Thomas",
      "title": "The Pragmatic Programmer",
      "description": "A timeless classic offering practical advice for programmers at all levels. The book provides tips on becoming more effective, covering personal responsibility, architectural techniques, continuous learning, and communication skills. It teaches critical thinking about programming problems and develops habits for long-term success in software development.",
      "price": 34.95,
      "publisher": "Tech Publications",
      "pages": 352,
      "topics": ["Programming Techniques", "Career Growth", "Software Engineering"]
    },
    {
      "author": "Martin Kleppmann",
      "title": "Designing Data-Intensive Applications",
      "description": "This comprehensive guide explores the principles behind reliable, scalable, and maintainable systems. It examines various data storage technologies, distributed system architectures, and consistency models. The book provides deep insights into how modern applications handle large-scale data and helps engineers make informed decisions about system design.",
      "price": 49.99,
      "publisher": "Tech Publications",
      "pages": 600,
      "topics": ["Distributed Systems", "Database Design", "Scalability"]
    },
    {
      "author": "Donald E. Knuth",
      "title": "The Art of Computer Programming",
      "description": "Knuth's monumental work is a must-have reference for serious computer scientists. Covering fundamental algorithms and their mathematical analysis, this series provides in-depth treatment of sorting, searching, combinatorial algorithms, and more. Though challenging, it offers unparalleled depth and rigor in algorithm analysis and computer programming theory.",
      "price": 89.99,
      "publisher": "Addison-Wesley",
      "pages": 650,
      "topics": ["Algorithms", "Mathematical Analysis", "Computer Science"]
    },
    {
      "author": "Thomas H. Cormen, Charles E. Leiserson, Ronald L. Rivest, Clifford Stein",
      "title": "Introduction to Algorithms",
      "description": "Widely used as a textbook in universities, this book provides a comprehensive introduction to modern algorithms. It covers a broad range of algorithms in depth while making their design and analysis accessible to all levels of readers. The book includes exercises and problems that help reinforce understanding of algorithm design techniques.",
      "price": 79.99,
      "publisher": "MIT Press",
      "pages": 1312,
      "topics": ["Algorithms", "Data Structures", "Computer Science"]
    },
    {
      "author": "Eric Evans",
      "title": "Domain-Driven Design",
      "description": "This book introduces the domain-driven design approach to developing complex software systems. It focuses on connecting implementation to an evolving model and provides a framework for making design decisions. The book is particularly valuable for projects where the business logic is complex and requires close collaboration between technical and domain experts.",
      "price": 44.99,
      "publisher": "Addison-Wesley",
      "pages": 560,
      "topics": ["Software Design", "Architecture", "Business Logic"]
    },
    {
      "author": "Steve McConnell",
      "title": "Code Complete",
      "description": "A practical handbook of software construction that covers the entire development process. The book provides numerous code examples and discusses topics like design, coding, debugging, and testing. It's filled with practical advice and checklists that help developers write better code and avoid common pitfalls in software development.",
      "price": 45.99,
      "publisher": "Microsoft Press",
      "pages": 914,
      "topics": ["Software Construction", "Coding Practices", "Debugging"]
    },
    {
      "author": "Kent Beck",
      "title": "Test-Driven Development",
      "description": "This book introduces the test-driven development methodology, where tests are written before the code. It demonstrates how TDD leads to better-designed, cleaner, and more reliable code. The book includes numerous examples in Python and shows how to apply TDD to both new projects and legacy code.",
      "price": 36.99,
      "publisher": "Addison-Wesley",
      "pages": 240,
      "topics": ["Testing", "Software Methodology", "Quality Assurance"]
    },
    {
      "author": "Michael T. Nygard",
      "title": "Release It!",
      "description": "This book focuses on designing and deploying production-ready software. It covers patterns for stability and anti-patterns to avoid, with real-world examples of system failures. The book is essential for developers and architects who want to build systems that can withstand real-world production environments.",
      "price": 42.99,
      "publisher": "Pragmatic Bookshelf",
      "pages": 376,
      "topics": ["System Design", "DevOps", "Production Environments"]
    },
    {
      "author": "Martin Fowler",
      "title": "Refactoring",
      "description": "This book introduces the concept of refactoring and provides a catalog of refactoring techniques. It shows how to improve the design of existing code through small, behavior-preserving transformations. The book includes examples in JavaScript and demonstrates how refactoring can make code easier to understand, modify, and extend.",
      "price": 47.99,
      "publisher": "Addison-Wesley",
      "pages": 448,
      "topics": ["Code Quality", "Software Maintenance", "Design Improvement"]
    }
  ]